GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_gpio.h
/**
  *******************************************************************************************************
  * @file    fm33lr0xx_fl_gpio.h
  * @author  FMSH Application Team
  * @brief   Head file of GPIO FL Module
  * @version  V1.0.6
  * @date     20. October 2025
  ****************************************************************************************************
  * @attention
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ****************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LR0XX_FL_GPIO_H
#define __FM33LR0XX_FL_GPIO_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lr0xx_fl_def.h"

/** @addtogroup FM33LR0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup GPIO_FL_ES_INIT GPIO Exported Init structures
  * @{
  */

/**
  * @brief FL GPIO Init Sturcture definition
  */
typedef struct
{
    /* PIN*/
    uint32_t pin;

    /* 功能模式*/
    uint32_t mode;

    /* 输出类型*/
    uint32_t outputType;

    /* 驱动强度*/
    uint32_t driveStrength;
	
	 /* 压摆率强度*/
    uint32_t slewrate;

    /* 上拉/下拉选择使能*/
    uint32_t pull;

    /* 数字功能重定向*/
    uint32_t remapPin;

    /*! 模拟开关使能 */
    FL_FunState analogSwitch;

} FL_GPIO_InitTypeDef;

/**
  * @brief FL GPIO WKUP Init Sturcture definition
  */
typedef struct
{
    /* */
    uint32_t polarity;

} FL_WKUP_InitTypeDef;
/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup GPIO_FL_Exported_Constants GPIO Exported Constants
  * @{
  */

#define    GPIO_PUDEN_PUD_Pos                                     (16U)
#define    GPIO_PUDEN_PUD_Msk                                     (0x1U << GPIO_PUDEN_PUD_Pos)
#define    GPIO_PUDEN_PUD                                         GPIO_PUDEN_PUD_Msk

#define    GPIO_PUDEN_PUDEN_Pos                                   (0U)
#define    GPIO_PUDEN_PUDEN_Msk                                   (0x1U << GPIO_PUDEN_PUDEN_Pos)
#define    GPIO_PUDEN_PUDEN                                       GPIO_PUDEN_PUDEN_Msk

#define    GPIO_FCR_Pos                                           (0U)
#define    GPIO_FCR_Msk                                           (0x3U << GPIO_FCR_Pos)
#define    GPIO_FCR                                               GPIO_FCR_Msk

#define    GPIO_DFS_Pos                                           (0U)
#define    GPIO_DFS_Msk                                           (0x3U << GPIO_DFS_Pos)
#define    GPIO_DFS                                               GPIO_DFS_Msk

#define    GPIO_SRDR_DR_Pos                                       (0U)
#define    GPIO_SRDR_DR_Msk                                       (0x1U << GPIO_SRDR_DR_Pos)
#define    GPIO_SRDR_DR                                            GPIO_SRDR_DR_Msk

#define    GPIO_SRDR_SR_Pos                                       (16U)
#define    GPIO_SRDR_SR_Msk                                       (0x1U << GPIO_SRDR_SR_Pos)
#define    GPIO_SRDR_SR                                            GPIO_SRDR_SR_Msk

#define    GPIO_TMUXR_PC7TMUX_Pos                                 (14U)
#define    GPIO_TMUXR_PC7TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC7TMUX_Pos)
#define    GPIO_TMUXR_PC7TMUX                                     GPIO_TMUXR_PC7TMUX_Msk

#define    GPIO_TMUXR_PC6TMUX_Pos                                 (12U)
#define    GPIO_TMUXR_PC6TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC6TMUX_Pos)
#define    GPIO_TMUXR_PC6TMUX                                     GPIO_TMUXR_PC6TMUX_Msk

#define    GPIO_TMUXR_PC5TMUX_Pos                                 (10U)
#define    GPIO_TMUXR_PC5TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC5TMUX_Pos)
#define    GPIO_TMUXR_PC5TMUX                                     GPIO_TMUXR_PC5TMUX_Msk

#define    GPIO_TMUXR_PC4TMUX_Pos                                 (8U)
#define    GPIO_TMUXR_PC4TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC4TMUX_Pos)
#define    GPIO_TMUXR_PC4TMUX                                     GPIO_TMUXR_PC4TMUX_Msk

#define    GPIO_TMUXR_PC3TMUX_Pos                                 (6U)
#define    GPIO_TMUXR_PC3TMUX_Msk                                 (0x3U << GPIO_TMUXR_PC3TMUX_Pos)
#define    GPIO_TMUXR_PC3TMUX                                     GPIO_TMUXR_PC3TMUX_Msk

