GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_gpio.h
/**
  * @brief    Toggle output pin
  * @rmtoll   DO        FL_GPIO_ToggleOutputPin
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_ToggleOutputPin(GPIO_Type *GPIOx, uint32_t pin)
{
    WRITE_REG(GPIOx->DO, READ_REG(GPIOx->DO) ^ pin);
}

/**
  * @brief    Set pin output 1
  * @rmtoll   DSET        FL_GPIO_SetOutputPin
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetOutputPin(GPIO_Type *GPIOx, uint32_t pin)
{
    WRITE_REG(GPIOx->DSET, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Set pin output 0
  * @rmtoll   DRST        FL_GPIO_ResetOutputPin
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_ResetOutputPin(GPIO_Type *GPIOx, uint32_t pin)
{
    WRITE_REG(GPIOx->DRST, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Get input data
  * @rmtoll   DIN        FL_GPIO_ReadInputPort
  * @param    GPIOx GPIO Port
  * @retval   Input data register value of port
  */
__STATIC_INLINE uint32_t FL_GPIO_ReadInputPort(GPIO_Type *GPIOx)
{
    return (uint32_t)(READ_BIT(GPIOx->DIN, (0xffffU << 0U)) >> 0U);
}

/**
  * @brief    Get GPIO input set status
  * @rmtoll   DIN        FL_GPIO_GetInputPin
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPIO_GetInputPin(GPIO_Type *GPIOx, uint32_t pin)
{
    return (uint32_t)(READ_BIT(GPIOx->DIN, ((pin & 0xffff) << 0x0U)) == ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Set GPIOx digital function
  * @rmtoll   DFS        FL_GPIO_SetPinRemap
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @param    function This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PINREMAP_FUNCTON1
  *           @arg @ref FL_GPIO_PINREMAP_FUNCTON2
  *           @arg @ref FL_GPIO_PINREMAP_FUNCTON3
  *           @arg @ref FL_GPIO_PINREMAP_FUNCTON4
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetPinRemap(GPIO_Type *GPIOx, uint32_t pin, uint32_t function)
{
    MODIFY_REG(GPIOx->DFS, ((pin * pin) * GPIO_DFS), ((pin * pin) * function));
}

/**
  * @brief    Get GPIOx digital function
  * @rmtoll   DFS        FL_GPIO_GetPinRemap
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_PINREMAP_FUNCTON1
  *           @arg @ref FL_GPIO_PINREMAP_FUNCTON2
  *           @arg @ref FL_GPIO_PINREMAP_FUNCTON3
  *           @arg @ref FL_GPIO_PINREMAP_FUNCTON4
  */
__STATIC_INLINE uint32_t FL_GPIO_GetPinRemap(GPIO_Type *GPIOx, uint32_t pin)
{
    return (uint32_t)(READ_BIT(GPIOx->DFS, ((pin * pin) * GPIO_DFS)) / (pin * pin));
}

/**
  * @brief    Set GPIOx Drive Strength To High
  * @rmtoll   SRDR    DR    FL_GPIO_SetDriveStrengthToHigh
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetDriveStrengthToHigh(GPIO_Type *GPIOx, uint32_t pin)
{
     CLEAR_BIT(GPIOx->SRDR, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Set GPIOx Drive Strength To Low
  * @rmtoll   SRDR    DR    FL_GPIO_SetDriveStrengthToLow
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetDriveStrengthToLow(GPIO_Type *GPIOx, uint32_t pin)
{
     SET_BIT(GPIOx->SRDR, ((pin & 0xffff) << 0x0U));
}

/**
  * @brief    Get GPIOx Drive Strength
  * @rmtoll   SRDR    DR    FL_GPIO_GetDriveStrength
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
   @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPIO_GetDriveStrength(GPIO_Type *GPIOx, uint32_t pin)
{
    return (uint32_t) (READ_BIT(GPIOx->SRDR, ((pin & 0xffff) << 0x0U)) == pin);
}

/**
  * @brief    Set GPIOx Slew Rate To High
  * @rmtoll   SRDR    SR    FL_GPIO_SetSlewRateToHigh
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetSlewRateToHigh(GPIO_Type *GPIOx, uint32_t pin)
{
    CLEAR_BIT(GPIOx->SRDR, ((pin & 0xffff) << GPIO_SRDR_SR_Pos));
}

/**
  * @brief    Set GPIOx Slew Rate To Low
  * @rmtoll   SRDR    SR    FL_GPIO_SetSlewRateToLow
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetSlewRateToLow(GPIO_Type *GPIOx, uint32_t pin)
{
    SET_BIT(GPIOx->SRDR, ((pin & 0xffff) << GPIO_SRDR_SR_Pos));
}

/**
  * @brief    Get GPIOx Slew Rate
  * @rmtoll   SRDR    DR    FL_GPIO_GetSlewRate
  * @param    GPIOx GPIO Port
  * @param    pin This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_PIN_0
  *           @arg @ref FL_GPIO_PIN_1
  *           @arg @ref FL_GPIO_PIN_2
  *           @arg @ref FL_GPIO_PIN_3
  *           @arg @ref FL_GPIO_PIN_4
  *           @arg @ref FL_GPIO_PIN_5
  *           @arg @ref FL_GPIO_PIN_6
  *           @arg @ref FL_GPIO_PIN_7
  *           @arg @ref FL_GPIO_PIN_8
  *           @arg @ref FL_GPIO_PIN_9
  *           @arg @ref FL_GPIO_PIN_10
  *           @arg @ref FL_GPIO_PIN_11
  *           @arg @ref FL_GPIO_PIN_12
  *           @arg @ref FL_GPIO_PIN_13
  *           @arg @ref FL_GPIO_PIN_14
  *           @arg @ref FL_GPIO_PIN_15
  *           @arg @ref FL_GPIO_PIN_ALL
   @retval   State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t FL_GPIO_GetSlewRate(GPIO_Type *GPIOx, uint32_t pin)
{
    return (uint32_t) (READ_BIT(GPIOx->SRDR, ((pin & 0xffff) << GPIO_SRDR_SR_Pos)) == (pin<<GPIO_SRDR_SR_Pos));
}

/**
  * @brief    Set PC7 Timer Channel Selection
  * @rmtoll   TMUXR    PC7TMUX    FL_GPIO_SetPC7TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH3N
  *           @arg @ref FL_GPIO_CHSEL_TI06
  *           @arg @ref FL_GPIO_CHSEL_TO06
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetPC7TimerChannelSelection(uint32_t channel)
{
    MODIFY_REG(GPIOC->TMUXR, GPIO_TMUXR_PC7TMUX_Msk, channel);
}

/**
  * @brief    Get PC7 Timer Channel Selection
  * @rmtoll   TMUXR    PC7TMUX    FL_GPIO_GetPC7TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH3N
  *           @arg @ref FL_GPIO_CHSEL_TI06
  *           @arg @ref FL_GPIO_CHSEL_TO06
  */
__STATIC_INLINE uint32_t FL_GPIO_GetPC7TimerChannelSelection(void)
{
    return (uint32_t)(READ_BIT(GPIOC->TMUXR, GPIO_TMUXR_PC7TMUX_Msk));
}

/**
  * @brief    Set PC6 Timer Channel Selection
  * @rmtoll   TMUXR    PC6TMUX    FL_GPIO_SetPC6TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH2N
  *           @arg @ref FL_GPIO_CHSEL_TI05
  *           @arg @ref FL_GPIO_CHSEL_TO05
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetPC6TimerChannelSelection(uint32_t channel)
{
    MODIFY_REG(GPIOC->TMUXR, GPIO_TMUXR_PC6TMUX_Msk, channel);
}

/**
  * @brief    Get PC6 Timer Channel Selection
  * @rmtoll   TMUXR    PC6TMUX    FL_GPIO_GetPC6TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH2N
  *           @arg @ref FL_GPIO_CHSEL_TI05
  *           @arg @ref FL_GPIO_CHSEL_TO05
  */
__STATIC_INLINE uint32_t FL_GPIO_GetPC6TimerChannelSelection(void)
{
    return (uint32_t)(READ_BIT(GPIOC->TMUXR, GPIO_TMUXR_PC6TMUX_Msk));
}

/**
  * @brief    Set PC5 Timer Channel Selection
  * @rmtoll   TMUXR    PC5TMUX    FL_GPIO_SetPC5TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH1N
  *           @arg @ref FL_GPIO_CHSEL_TI04
  *           @arg @ref FL_GPIO_CHSEL_TO04
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetPC5TimerChannelSelection(uint32_t channel)
{
    MODIFY_REG(GPIOC->TMUXR, GPIO_TMUXR_PC5TMUX_Msk, channel);
}

/**
  * @brief    Get PC5 Timer Channel Selection
  * @rmtoll   TMUXR    PC5TMUX    FL_GPIO_GetPC5TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH1N
  *           @arg @ref FL_GPIO_CHSEL_TI04
  *           @arg @ref FL_GPIO_CHSEL_TO04
  */
__STATIC_INLINE uint32_t FL_GPIO_GetPC5TimerChannelSelection(void)
{
    return (uint32_t)(READ_BIT(GPIOC->TMUXR, GPIO_TMUXR_PC5TMUX_Msk));
}

/**
  * @brief    Set PC4 Timer Channel Selection
  * @rmtoll   TMUXR    PC4TMUX    FL_GPIO_SetPC4TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH4
  *           @arg @ref FL_GPIO_CHSEL_TI03
  *           @arg @ref FL_GPIO_CHSEL_TO03
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetPC4TimerChannelSelection(uint32_t channel)
{
    MODIFY_REG(GPIOC->TMUXR, GPIO_TMUXR_PC4TMUX_Msk, channel);
}

/**
  * @brief    Get PC4 Timer Channel Selection
  * @rmtoll   TMUXR    PC4TMUX    FL_GPIO_GetPC4TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH4
  *           @arg @ref FL_GPIO_CHSEL_TI03
  *           @arg @ref FL_GPIO_CHSEL_TO03
  */
__STATIC_INLINE uint32_t FL_GPIO_GetPC4TimerChannelSelection(void)
{
    return (uint32_t)(READ_BIT(GPIOC->TMUXR, GPIO_TMUXR_PC4TMUX_Msk));
}

/**
  * @brief    Set PC3 Timer Channel Selection
  * @rmtoll   TMUXR    PC3TMUX    FL_GPIO_SetPC3TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH3
  *           @arg @ref FL_GPIO_CHSEL_TI02
  *           @arg @ref FL_GPIO_CHSEL_TO02
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetPC3TimerChannelSelection(uint32_t channel)
{
    MODIFY_REG(GPIOC->TMUXR, GPIO_TMUXR_PC3TMUX_Msk, channel);
}

/**
  * @brief    Get PC3 Timer Channel Selection
  * @rmtoll   TMUXR    PC3TMUX    FL_GPIO_GetPC3TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH3
  *           @arg @ref FL_GPIO_CHSEL_TI02
  *           @arg @ref FL_GPIO_CHSEL_TO02
  */
__STATIC_INLINE uint32_t FL_GPIO_GetPC3TimerChannelSelection(void)
{
    return (uint32_t)(READ_BIT(GPIOC->TMUXR, GPIO_TMUXR_PC3TMUX_Msk));
}

/**
  * @brief    Set PC2 Timer Channel Selection
  * @rmtoll   TMUXR    PC2TMUX    FL_GPIO_SetPC2TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH2
  *           @arg @ref FL_GPIO_CHSEL_TI01
  *           @arg @ref FL_GPIO_CHSEL_TO01
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetPC2TimerChannelSelection(uint32_t channel)
{
    MODIFY_REG(GPIOC->TMUXR, GPIO_TMUXR_PC2TMUX_Msk, channel);
}

/**
  * @brief    Get PC2 Timer Channel Selection
  * @rmtoll   TMUXR    PC2TMUX    FL_GPIO_GetPC2TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH2
  *           @arg @ref FL_GPIO_CHSEL_TI01
  *           @arg @ref FL_GPIO_CHSEL_TO01
  */
__STATIC_INLINE uint32_t FL_GPIO_GetPC2TimerChannelSelection(void)
{
    return (uint32_t)(READ_BIT(GPIOC->TMUXR, GPIO_TMUXR_PC2TMUX_Msk));
}

/**
  * @brief    Set PC1 Timer Channel Selection
  * @rmtoll   TMUXR    PC1TMUX    FL_GPIO_SetPC1TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @param    channel This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH1
  *           @arg @ref FL_GPIO_CHSEL_TI00
  *           @arg @ref FL_GPIO_CHSEL_TO00
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetPC1TimerChannelSelection(uint32_t channel)
{
    MODIFY_REG(GPIOC->TMUXR, GPIO_TMUXR_PC1TMUX_Msk, channel);
}

/**
  * @brief    Get PC1 Timer Channel Selection
  * @rmtoll   TMUXR    PC1TMUX    FL_GPIO_GetPC1TimerChannelSelection
  * @param    GPIOC GPIOC instance
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_CHSEL_ATIM_CH1
  *           @arg @ref FL_GPIO_CHSEL_TI00
  *           @arg @ref FL_GPIO_CHSEL_TO00
  */
__STATIC_INLINE uint32_t FL_GPIO_GetPC1TimerChannelSelection(void)
{
    return (uint32_t)(READ_BIT(GPIOC->TMUXR, GPIO_TMUXR_PC1TMUX_Msk));
}

/**
  * @brief    EXTI edge0 select
  * @rmtoll   EXTIEDS0        FL_GPIO_SetTriggerEdge0
  * @param    GPIOx GPIO Port
  * @param    line This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_EXTI_LINE_0
  *           @arg @ref FL_GPIO_EXTI_LINE_1
  *           @arg @ref FL_GPIO_EXTI_LINE_2
  *           @arg @ref FL_GPIO_EXTI_LINE_3
  *           @arg @ref FL_GPIO_EXTI_LINE_4
  *           @arg @ref FL_GPIO_EXTI_LINE_5
  *           @arg @ref FL_GPIO_EXTI_LINE_6
  *           @arg @ref FL_GPIO_EXTI_LINE_7
  *           @arg @ref FL_GPIO_EXTI_LINE_8
  *           @arg @ref FL_GPIO_EXTI_LINE_9
  *           @arg @ref FL_GPIO_EXTI_LINE_10
  *           @arg @ref FL_GPIO_EXTI_LINE_11
  *           @arg @ref FL_GPIO_EXTI_LINE_12
  *           @arg @ref FL_GPIO_EXTI_LINE_13
  *           @arg @ref FL_GPIO_EXTI_LINE_14
  *           @arg @ref FL_GPIO_EXTI_LINE_15
  * @param    edge This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_RISING
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_FALLING
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_BOTH
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_DISABLE
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetTriggerEdge0(GPIO_COMMON_Type *GPIOx, uint32_t line, uint32_t edge)
{
    MODIFY_REG(GPIOx->EXTIEDS0, ((line * line) * GPIO_EXTIEDS0), ((line * line) * edge));
}

/**
  * @brief    Get EXTI edge0 select
  * @rmtoll   EXTIEDS0        FL_GPIO_GetTriggerEdge0
  * @param    GPIOx GPIO Port
  * @param    line This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_EXTI_LINE_0
  *           @arg @ref FL_GPIO_EXTI_LINE_1
  *           @arg @ref FL_GPIO_EXTI_LINE_2
  *           @arg @ref FL_GPIO_EXTI_LINE_3
  *           @arg @ref FL_GPIO_EXTI_LINE_4
  *           @arg @ref FL_GPIO_EXTI_LINE_5
  *           @arg @ref FL_GPIO_EXTI_LINE_6
  *           @arg @ref FL_GPIO_EXTI_LINE_7
  *           @arg @ref FL_GPIO_EXTI_LINE_8
  *           @arg @ref FL_GPIO_EXTI_LINE_9
  *           @arg @ref FL_GPIO_EXTI_LINE_10
  *           @arg @ref FL_GPIO_EXTI_LINE_11
  *           @arg @ref FL_GPIO_EXTI_LINE_12
  *           @arg @ref FL_GPIO_EXTI_LINE_13
  *           @arg @ref FL_GPIO_EXTI_LINE_14
  *           @arg @ref FL_GPIO_EXTI_LINE_15
  * @retval   Returned value can be one of the following values:
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_RISING
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_FALLING
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_BOTH
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_DISABLE
  */
__STATIC_INLINE uint32_t FL_GPIO_GetTriggerEdge0(GPIO_COMMON_Type *GPIOx, uint32_t line)
{
    return (uint32_t)(READ_BIT(GPIOx->EXTIEDS0, ((line * line) * GPIO_EXTIEDS0)) / (line * line));
}

/**
  * @brief    EXTI edge1 select
  * @rmtoll   EXTIEDS1        FL_GPIO_SetTriggerEdge1
  * @param    GPIOx GPIO Port
  * @param    line This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_EXTI_LINE_16
  *           @arg @ref FL_GPIO_EXTI_LINE_17
  *           @arg @ref FL_GPIO_EXTI_LINE_18
  * @param    edge This parameter can be one of the following values:
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_RISING
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_FALLING
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_BOTH
  *           @arg @ref FL_GPIO_EXTI_TRIGGER_EDGE_DISABLE
  * @retval   None
  */
__STATIC_INLINE void FL_GPIO_SetTriggerEdge1(GPIO_COMMON_Type *GPIOx, uint32_t line, uint32_t edge)
{
    MODIFY_REG(GPIOx->EXTIEDS1, (((line >> 16) * (line >> 16)) * GPIO_EXTIEDS1),
               (((line >> 16) * (line >> 16)) * edge));
}

